#define Bit(n) (1 << (n))
/*
  p |= Bit(n);                Для установки бита n в порту p:
  p &= ~Bit(n);               Для сброса бита n в порту p:
  if ((p & Bit(n)) != 0) ...  Для проверки бита n в порту p: (сравнение)
*/
#define EEADR1 10                                                               // коеффициент       (адрес EE, куда сохраняем,
#define EEADR2 22                                                               // общий расход       любой, больше 1)

#include <iom8.h>
#include <inavr.h>
#include <stdio.h>
#include <string.h>

static char seg[4],seg_count=0;                                                 // массив для хранения числа одного их 4-х индикаторов при динамической индикации; номер выводимого индикатора
static char timer2comp=0,g_eesave_en=0;                                         // флаги для обновления экрана, сохранения в EE
static char str[10];
static unsigned short ADCrez=0,g_Hset=0;                                        // значение переменной в АЦП; коэффициент (производительность форсунки)
static char g_Uset=1,g_Hblk=3,g_Hled=0;                                         // выбор режима (User); "мигание" n-го разряда индикатора (дисплея); флаг для управлением миганием разряда
static unsigned short g_time_ovf=0;                                             // число "раз" переполнения таймера
static unsigned long g_fors_time=0,g_full_time=0,g_total_fuel=0;                // t(время) одного импулса; t всех имп. в ед. времени; сумма t всех имп. /1000 (делен. на 1000), т.к. иначе нам не хватит разрядности из-за очень большого числа
static unsigned short g_time_s=0,mg_fuel=0;                                     // время ед. времени, за которую показывается мгновенный час. расход;

//-----------------------------------------------------------------------------------------------------------------------------
#pragma vector = INT1_vect                                                      // INT1 (
__interrupt void MY_INT1 (void)                                                 // стандартная запись)
{
    if ((MCUCR & Bit(ISC10)) != 0)                                              // прерывание произошло по нарастающему фронту
    {   TCCR1B = Bit(CS11);                                                     // запуск таймера c clk/8
        MCUCR &= ~Bit(ISC10);                                                   // сбрасываем бит в регистре MCUCR для инициализации следующего прерывания по спадающему фронту
    }
    else                                                                        // прерывание произошло по спаду
    {   TCCR1B = 0;                                                             // останов таймера
        MCUCR |= Bit(ISC10);                                                    // устанавливаем бит в регистре MCUCR для инициализации следующего прерывания по нарастающему фронту
        g_fors_time = g_time_ovf; g_fors_time = g_fors_time << 16; g_fors_time = g_fors_time + TCNT1;   // сумма полных переполнений таймера, 16-бит. значение, и его текущего 8-бит. значения
        g_full_time = g_full_time + g_fors_time;
        TCNT1 = 0; g_time_ovf=0;
    }
    
}
//-----------------------------------------------------------------------------------------------------------------------------
#pragma vector = TIMER1_OVF_vect                                                // timer 1 overflow - таймер переполнения
__interrupt void MY_TIMER1_OVF (void)                                           // без этой функции программа будет считать форсунку открытой при включенном зажигании и неработающем двигателе, тем самым... сами понимаете
{
g_time_ovf ++;                                                                  // считаем "разряды" (число раз переполнения 65536) и увеличиваем на 1

    if (g_time_ovf > 28)                                                        // 2 сек нет сигнала - 7372800/8/65536 = 14 (раз) - это 1 сек.(примерно)
    {TCCR1B = 0;                                                                // останов таймера
     MCUCR |= Bit(ISC10);                                                       // устанавливаем бит в регистре MCUCR для инициализации следующего прерывания по нарастающему фронту
     TCNT1 = 0; g_time_ovf=0;
     g_eesave_en=1;                                                             // ставим флаг для сохранения по этому событию в EE
    }    
}
//-----------------------------------------------------------------------------------------------------------------------------
#pragma vector = ADC_vect                                                       // ADC - 10-бит АЦП
__interrupt void MY_ADC (void)
{
ADCrez = ADCL; ADCrez = ADCrez + (ADCH << 8);                                   // считывание из 2-х регистров 10-битного значения АЦП, (сначало младший (L), потом старший (H)
}
//-----------------------------------------------------------------------------------------------------------------------------
#pragma vector = TIMER2_COMP_vect                                               // ф-ция для установки флага ПО СРАВНЕНИЮ с заданным числом раз его отсчетов (у нас 7200), т.е. каждые 7200 тиков таймера прибавляется 1 (у нас 20);
__interrupt void MY_TIMER2_COMPARE (void)                                       // и если мы принудительно сбросим флаг (в период времени) до 20, то по достижению 20 флаг сам снова установится (у нас это используется для
{                                                                               // обновления экрана при динамической индикации, см. ниже в main)
timer2comp=1;
}
//-----------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------
void init ()                                                                    // начальная инициализация
{
char m=0;                                                                       // вспомогательная переменная для чтения из EE
DDRD |= Bit(5);                                                                 // порты на выход
DDRD |= Bit(6);
DDRD |= Bit(7);
DDRB |= Bit(0);
DDRB |= Bit(1);
DDRB |= Bit(2);
DDRB |= Bit(3);
DDRB |= Bit(4);

DDRC |= Bit(3);
DDRC |= Bit(4);
DDRC |= Bit(5);
DDRD |= Bit(0);

DDRD |= Bit(4);
PORTD &= ~Bit(3);                                                               // INT1  (по умолчанию на вход) и сбросить бит, установить в 0 (нет сигнала с форсунки)

seg[0]=6; seg[1]=91; seg[2]=79; seg[3]=102;                                     // начальный "тестовый" вывод на индикатор "4321"
//------------------------------------------------------------- timer counter 2
OCR2 = 20;                                                                      // установка "делителя" в регистре сравнения для определения частоты обновления "экрана" индикатора 7372800/1024(делитель см. ниже) / 20 = 360, 360/4=90 - частота "мерцания" одного разряда индикатора
TIMSK |= Bit(OCIE2);                                                            // устанавливаем флаг разрешения прерывания по событию "совпадение" таймера/счетчика Т2
TCCR2 = Bit(WGM21) | Bit(CS22) | Bit(CS21) | Bit(CS20);                         // путем побитного "сравнения" установить биты в разрядах регистра TCCR2 : CTC(сброс при совпадении), остальные - для установки делителя в 1024
//------------------------------------------------------------- timer counter 1
TIMSK |= Bit(TOIE1);                                                            // устанавливаем флаг разрешения прерывания по переполнению таймера/счетчика Т1
//----------------------------------------------------------------------- INT 1
MCUCR |= Bit(ISC11);                                                            // начальная (и const всегда) установка бита для условия генерации внеш. прерывания по любому фронту
MCUCR |= Bit(ISC10);                                                            // начальная установка бита для условия генерации внеш. прерывания по нарастающему фронту
GICR |= Bit(INT1);                                                              // разрешение внешнего прерывания INT1
//------------------------------------------------------------------------- ADC
ADMUX = Bit(REFS0);                                                             // внутренний источнник опорного напряжения - 2.56 V
ADCSR = Bit(ADEN) | Bit(ADIE) | Bit(ADPS2) | Bit(ADPS1) | Bit(ADPS0);           // путем побитного "сравнения" установить биты в разрядах регистра ADCSR : АЦП включено, остальные - для установки делителя частоты преобразования в 128
ADCSR |= Bit(ADSC);                                                             // запуск каждого преобразования в режиме одиночного преобразования (у нас) по первому нарастающему фронту тактового сигнала
//--------------------------------------------------------------------- read EE
__EEGET(g_Hset, EEADR1); g_Hset = g_Hset << 8; __EEGET(m, EEADR1+1); g_Hset = g_Hset + m;   // чтение 1-го байта 16-бит g_Hset по адресу EEADR1 с последующим чтением второго байта по адресу EEADR1+1
if (g_Hset > 9999) g_Hset = 0;                                                  // при первой прошивки "обнулить в памяти" все F -ы

__EEGET(g_total_fuel, EEADR2); g_total_fuel = g_total_fuel << 8;                // чтение 1-го байта 32-бит g_total_fuel по адресу EEADR2 с последующим чтением второго и т.д. байта; по адресу EEADR2 считываем данные и заносим их в g_total_fuel,
__EEGET(m, EEADR2+1); g_total_fuel = g_total_fuel + m; g_total_fuel = g_total_fuel << 8;    // затем сдвигаем данные на 8 разрядов влево, тем самым увеличивая разрядность g_total_fuel до 16 бит, далее считываем данные по адресу EEADR2+1 и
__EEGET(m, EEADR2+2); g_total_fuel = g_total_fuel + m; g_total_fuel = g_total_fuel << 8;    // заносим их в "m", после к предыдущему значению g_total_fuel прибавляем "m" и записываем все g_total_fuel с последующим сдвигом влево также на 8
__EEGET(m, EEADR2+3); g_total_fuel = g_total_fuel + m;                          // разрядов и увеличением размера g_total_fuel до 3-х байт, и т.д. до 4-х(32) байт(бит), и в итоге, с полным считыванием конечного значения g_total_fuel из EE;
                                                                                // у нас сделано так, что мы из памяти берем полное время открытия форсунки, чтобы затем подставив его в "нашу" формулу расчитать полный расход и вывести его на дисплей
//-----------------------------------------------------------------------------
__enable_interrupt();                                                           // разрешить все прерывания (в регистре SREG установить бит 7, называющийся " I "
}
//-----------------------------------------------------------------------------------------------------------------------------
char OutDisp ()                                                                 // динамическая индикация и "сканирование клавиатуры"
{
static char key=0;                                                              // переменная для хранения номера нажатой кнопки

    PORTD &= ~Bit(0);                                                           // общие аноды разрядов индикатора отключить (погасить) 
    PORTC &= ~Bit(5);
    PORTC &= ~Bit(4);
    PORTC &= ~Bit(3);

  if ((seg[seg_count] & Bit(0)) != 0)   {PORTD &= ~Bit(6);} else {PORTD |= Bit(6);}   // вывод данных на сегменты "соответствующего" индикатора: включение сегмента происходит по нулевому сигналу; например
  if ((seg[seg_count] & Bit(1)) != 0)   {PORTD &= ~Bit(7);} else {PORTD |= Bit(7);}   // seg[0] = 11011000, тогда путем побитного "сравнения" с "11111111" зажечь (напротив 1) или погасить (напротив 0)
  if ((seg[seg_count] & Bit(2)) != 0)   {PORTB &= ~Bit(0);} else {PORTB |= Bit(0);}   // соответствующие сегменты одного индикатора; а также "упорядочивание" выходов портов на сегменты с номером разряда
  if ((seg[seg_count] & Bit(3)) != 0)   {PORTB &= ~Bit(1);} else {PORTB |= Bit(1);}   // 8-бит числа и в соответствии с "a b c d e f g h" : PD6-a(0-й, младший разряд), PD7-b, ..., PB4-g, PD5-h(7-й, старший)
  if ((seg[seg_count] & Bit(4)) != 0)   {PORTB &= ~Bit(2);} else {PORTB |= Bit(2);}
  if ((seg[seg_count] & Bit(5)) != 0)   {PORTB &= ~Bit(3);} else {PORTB |= Bit(3);}
  if ((seg[seg_count] & Bit(6)) != 0)   {PORTB &= ~Bit(4);} else {PORTB |= Bit(4);}
  if ((seg[seg_count] & Bit(7)) != 0)   {PORTD &= ~Bit(5);} else {PORTD |= Bit(5);}

    if (seg_count == 0) {PORTD |= Bit(0);} else {PORTD &= ~Bit(0);}             // включение соответствующего индикатора
    if (seg_count == 1) {PORTC |= Bit(5);} else {PORTC &= ~Bit(5);}
    if (seg_count == 2) {PORTC |= Bit(4);} else {PORTC &= ~Bit(4);}
    if (seg_count == 3) {PORTC |= Bit(3);} else {PORTC &= ~Bit(3);}

  if ((PINC & Bit(2)) != 0) {key |= Bit(seg_count); } else {key &= ~Bit(seg_count);}   // чтение кнопок ("сканирование клавиатуры): если нажата n-кнопка, прописываем в key соответствующий бит по номеру n-кнопки, которая
                                                                                // определяется при включении соответствующего индикатора: (первый (0-вой) - 0001 (1), второй - 0010 (2), 3-й - 0100 (4), 4-й - 1000 (8)
seg_count++;                                                                    // динамический переход на следующий индикатор
if (seg_count > 3) seg_count=0;                                                 // зацикливание функции
return key;                                                                     // вернуть значение key для последующего использования для определения нажатой кнопки
}
//-----------------------------------------------------------------------------------------------------------------------------
char getCode (char ch)                                                          // "сопоставление" символам из таблицы ASCII "наших" символов,
{                                                                               // составленных из отдельных сегментов индикаторв при помощи
    switch (ch)                                                                 // представления в десятичном коде, например:
    {   case '0': return  63; // "0"                                            // 63 - 0b00111111, а это "зажечь" сегменты - abcdef, следовательно на индикаторе высветится цифра - 0
        case '1': return   6; // "1"                                            // 0b00000110 - bc
        case '2': return  91; // "2"                                            // 0b01011011 - ab de g
        case '3': return  79; // "3"
        case '4': return 102; // "4"
        case '5': return 109; // "5"
        case '6': return 125; // "6"
        case '7': return   7; // "7"
        case '8': return 127; // "8"
        case '9': return 111; // "9"
        case 'U': return  62; // 
        case 'H': return 118; // 
        case 'F': return 113; // 
        case ' ': return   0; // 
    }
return 1;                                                                       // на всякий, "пожарный" (будет гореть один верхний сегмент "a" на индикаторе)
}
//-----------------------------------------------------------------------------------------------------------------------------
void SetDataDisp (char mode, unsigned short parameter)                          // представление 16-тиричного числа в виде 10-тичного
{                                                                               // и вывод его посредством строки ("картинки")
char s;
    switch (mode)
    {   case 0:                                                                 // тестовый вывод - "4321"
                break;
        case 1:                                                                 // напряжение
                sprintf (str,"U%3d",parameter);                                 // выводим "U"(напряжение); первые 3 разряды целого 10-тичного числа; 16-тиричную переменную в parameter преобразовываем в 10-тичную и выводим(зажигаем) на индикаторе в виде строки посредством функции getCode
                s=getCode (str[0]); s=s|(1<<7); seg[3]=s;                       // посредством функции getCode зажигаем на 1-ом слева(лв.) индикаторе - "U"; при побитном ИЛИ устанавливаем бит в 7-ом разряде, тем самым зажигая сегмент "h", т.е. точку на 1-ом лв. индикаторе; обновление массива данных для вывода на дисплей(индикаторы), т.е. обновление 1-го лв. индикатора с последующим его зажиганием функцией OutDisp
                s=getCode (str[1]); seg[2]=s;                                   // посредством функции getCode зажигаем на 2-ом лв. индикаторе - 1-ую цифру первых 3-х разрядов(%3d) целого числа, преобразованного из переменной parameter, формула вывода напряжения (в диапазоне ~ 5-18V) выведена в главной ф-ции main (ниже)
                s=getCode (str[2]); s=s|(1<<7); seg[1]=s;
                s=getCode (str[3]); seg[0]=s;
                break;
        case 2:                                                                 // общий расход
                sprintf (str,"F%3d",parameter);
                s=getCode (str[0]); s=s|(1<<7); seg[3]=s;
                s=getCode (str[1]); seg[2]=s;
                s=getCode (str[2]); if (s == 0) {s = 63;} if (parameter < 1000) {s=s|(1<<7);}   seg[1]=s; // также, при нулевом значении выводим на дисплей "0", и если от 0 до 99,9 литров, зажигаем точку на этом индикаторе; при расходе от 100 и больше литров, расход показывается без десятых, в целых литрах
                s=getCode (str[3]); seg[0]=s;                                   // ...если значение "0", на дисплее будут гореть 3 и 4 лв. индикаторы - "0.0"
                break;        
        case 3:                                                                 // часовой расход
                sprintf (str,"H%3d",parameter);
                s=getCode (str[0]); s=s|(1<<7); seg[3]=s;
                s=getCode (str[1]); seg[2]=s;
                s=getCode (str[2]); if (s == 0) {s = 63;} s=s|(1<<7); seg[1]=s;
                s=getCode (str[3]); seg[0]=s;                                   // ..."0.0"
                break;        
        case 4:                                                                 // настройка (поразрядное мигание дисплея; описание "миганий" с 1-го лв. разряда по 4-й)
                sprintf (str,"%04d",parameter); 
                if (g_Hblk == 3)                                                // если надо вывести мигание на 1-й лв. разряд дисплея
                { if (g_Hled == 1) {g_Hled=0; seg[3]=getCode (' '); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);}    // если флаг=1, переводим его в 0 и выполняем все после "if", иначе, если 0, его в 1 и выполняем после "else" : если 1, гасим (пробел) 1-й лв. разряд индикатора, в остальные
                              else {g_Hled=1; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);} // разряды выводим полученные значения из "main", если 0, во все разряды выводим полученные значения из "main", тем самым инициируя режим мигания n-го(1) разряда
                }
                if (g_Hblk == 2) 
                { if (g_Hled == 1) {g_Hled=0; seg[3]=getCode (str[0]); seg[2]=getCode (' '); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);}
                              else {g_Hled=1; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);}
                }
                if (g_Hblk == 1) 
                { if (g_Hled == 1) {g_Hled=0; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (' '); seg[0]=getCode (str[3]);}
                              else {g_Hled=1; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);}
                }
                if (g_Hblk == 0) 
                { if (g_Hled == 1) {g_Hled=0; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (' ');}
                              else {g_Hled=1; seg[3]=getCode (str[0]); seg[2]=getCode (str[1]); seg[1]=getCode (str[2]); seg[0]=getCode (str[3]);}
                }
                break;        
        default: seg[0]=6; seg[1]=91; seg[2]=79; seg[3]=102;                    // по идее быть не должно, но на всякий "пожарный", если что, выведем "4321"
                break;
    }

}
//-----------------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------- а теперь - о главном :)
void main ()
{
static char key=0,key_old=0; 
static unsigned short key_count=0,timer_count=0,mg_rash=0;                      // время нажатого состояния кнопки;
static unsigned long med_fuel=0,tm=0;                                           // "средний" расход и переменная (tm) для расчета "g_total_fuel" с учетом деления на 1000 
static float Uadc=0;

init ();                                                                        // запускаем ф-цию начальной инициализации
for (;;)                                                                        // запускаем бесконечный цикл
{
    if (timer2comp == 1)                                                        // выполнение (ниже) кода с частотой 7200/20=360 Гц
    {
    //----------------
                                                                                // часовой расход
            if (g_time_s < 360) {g_time_s++;}                                   // ждем истечения 1-й сек.
              else {g_time_s=0; mg_rash = (unsigned long) (g_full_time * g_Hset ) / ((73728000 / 8) / 6 ) ; // обнуляем время, чтобы в следующий раз посчитать новый мгнв. расход;  считаем текущий мгнв. расход в литрах; 
                    med_fuel += g_full_time; g_full_time=0; }                   // записываем в med_fuel сумму из "g_full_time" (время всех имп. в ед. времени - у нас 1 сек.) и "med_fuel" - числа 50 (как пример), см. ниже, которое осталось от "целой части после деления на 1000"), и после "g_full_time" обнуляем для последующего нового использования при определения нового мгнв. час. расхода

                                                                                // общий расход
            if (med_fuel > 1000) { tm = med_fuel / 1000; g_total_fuel += tm; med_fuel -= tm*1000; // т.к. значение в g_total_fuel получается очень большим, то мы уменьшаем его в 1000 раз, а в формуле для определения полного расхода учитываем то, что нам надо умножить на "лишнюю" 1000 для получения правильного результата; если med_fuel > 1000, (например, 500050), то мы
                mg_fuel = (unsigned long) (g_total_fuel * g_Hset ) / ((7372800 / 8)* 6); }        // в "tm" записываем целое число от деления на 1000 (500) и прибавляем его к "g_total_fuel" (например, 20), в итоге получаем - 520; в "med_fuel" у нас теперь будет - (500050-500*1000=50) число - 50, которое будет учитываться для определения "среднего" расхода, см. выше
                 
                                                                                // сохранение общего расхода
            if (g_eesave_en == 1) { __EEPUT(EEADR2,g_total_fuel >> 24); __EEPUT(EEADR2+1,g_total_fuel >> 16); // если 2 сек. нет сигнала с форсунки, сохраняем в EE полное время (новое, т.к. при включении мы из EE считываем старое, и если оно не равно 0, то оно, естественно, будет учитываться при получении нового значения) открытия форсунки, чтобы нам в последствии считывая его показать полный расход, расчитанный по "нашей" формуле значение в g_total_fuel
                __EEPUT(EEADR2+2,g_total_fuel >> 8); __EEPUT(EEADR2+3,(char)g_total_fuel); g_eesave_en=0;}    // мы сдвигаем на 24 разряда вправо, и оставшийся один старший байт заносим в адрес EEADR2, далее знач. в g_total_fuel сдвигаем на 16 разрядов вправо, а т.к. функции "__EEPUT" оперирует "char" значением, то после сдвига в адрес EEADR2+1 запишется младший байт оставшегося 2-х байтного числа, а это 2-й старший байт 4-х байтной переменной g_total_fuel,
                                                                                // затем записываем в адрес EEADR2+2 - 3-й байт, и в EEADR2+3 - 4-й (младший) байт g_total_fuel; если писать правильно, то перед g_total_fuel надо было бы записать - "(unsigned char)", но в нашем компиляторе (IAR) в настройках стоит, что "unsigned char" можно писать просто как "char", что и показано в последней строчке; ну и затем сбрасываем флаг, чтобы быть готовыми к новому сохранению
    //----------------
    key_old = key;                                                              // сохраняем в "old" номер кнопки, которая была отпущена последней - используем это для: антидребезга, включения по отжатию(отпусканию) кнопок и времени нажатия кнопок
    key = OutDisp ();                                                           // берем новое значение номера кнопки, которая нажата в текущий момент, из ф-ции "OutDisp"
    if (key == 0) PORTD |= Bit(4); else PORTD &= ~Bit(4);                       // если не нажата ни одна кнопка - зажигаем светодиод, при нажатии любой кнопки - гасим
        if (key != key_old)                                                     // если нажата новая кнопка (а не продолжает оставаться нажатой "старая" кнопка)
        {   
            if (key_count > 720)                                                // нажатие более 2 сек. и антидребезг
            {
                  //  if ((key_old & Bit(0)) != 0) {seg[0]=91;}                 // нажата кнопка 0     /* режим
                  //  if ((key_old & Bit(1)) != 0) {seg[0]=79;}                 // нажата кнопка 1        тестирования,
                  //  if ((key_old & Bit(2)) != 0) {seg[0]=79;}                 // нажата кнопка 2        для будущих функций */
              if ((key_old & Bit(3)) != 0) {                                    // нажата кнопка 3 (1-ая лв.) - (т.к. после считывания все кнопки отжаты (считываем по отпусканию), и нам надо взять значение последней нажатой кнопки, то используем значение в "key_old", а не "key")
                                              if (g_Uset == 2)  {g_total_fuel = 0;}   // при удержании кнопки более 2 сек. в режиме полного расхода, обнуляем последний (g_Uset - см. ниже)
                                              if (g_Uset == 3)  {g_Uset = 4;}         // если находимся в режиме часового расхода - входим в режим ввода коэф-та
                                             }  
              key_count=0;                                
            }   
            if (key_count > 20)                                                 // нажатие менее 2 сек. и антидребезг
            {
                if ((key_old & Bit(0)) != 0) {if (g_Uset == 4)                  // нажата кнопка 0 (4-ая лв.) и активирован режим ввода коэф-та
                                              { if (g_Hblk == 3) {g_Hblk = 2;}  // если мигает (для установки нового значения) 1-й лв. разряд - передти к установке
                                           else if (g_Hblk == 2) {g_Hblk = 1;}
                                           else if (g_Hblk == 1) {g_Hblk = 0;}
                                           else if (g_Hblk == 0) {g_Hblk = 3; g_Uset = 3; __EEPUT(EEADR1,g_Hset >> 8);
                                                                                          __EEPUT(EEADR1+1,(char)g_Hset); } // запись в EE
                                              }
                                             }   
                if ((key_old & Bit(1)) != 0) {if (g_Uset == 4)                  // нажата кнопка 1
                                              { if (g_Hblk == 3) {if (g_Hset >= 1000) { g_Hset = g_Hset - 1000;}}
                                                if (g_Hblk == 2) {if (g_Hset >= 100) { g_Hset = g_Hset - 100;}}
                                                if (g_Hblk == 1) {if (g_Hset >= 10) { g_Hset = g_Hset - 10;}}
                                                if (g_Hblk == 0) {if (g_Hset >= 1) { g_Hset = g_Hset - 1;}}
                                              }
                                             }   
                if ((key_old & Bit(2)) != 0) {if (g_Uset == 4)                  // нажата кнопка 2
                                              { if (g_Hblk == 3) {if ((g_Hset + 1000) < 10000) {g_Hset = g_Hset + 1000;}}
                                                if (g_Hblk == 2) {if ((g_Hset + 100) < 10000) {g_Hset = g_Hset + 100;}}
                                                if (g_Hblk == 1) {if ((g_Hset + 10) < 10000) {g_Hset = g_Hset + 10;}}
                                                if (g_Hblk == 0) {if ((g_Hset + 1) < 10000) {g_Hset = g_Hset + 1;}}
                                              } 
                                             }   
                if ((key_old & Bit(3)) != 0) {                                  // нажата кнопка 3
                                                if (g_Uset == 0)  g_Uset = 1;
                                          else  if (g_Uset == 1)  g_Uset = 3;   // U
                                          else  if (g_Uset == 2)  g_Uset = 1;   // H  
                                          else  if (g_Uset == 3)  g_Uset = 2;   // F
                                          else  if (g_Uset == 4)  g_Uset = 3;
                                             }   
            }   
        }
    if (key != 0 && key == key_old) {key_count++;} else {key_count=0;}
    //----------------
    if (timer_count > 180)                                                      // 0.5 сек. - это задержка для вывода напряжения, т.к. значения сразу берутся с АЦП и
    {                                                                           // быстро изменяющиеся значения начинают "сливаться", тогда как по остальным режимам
                                                                                // обсчет ведется 1 раз в сек., и эта задержка на эти режимы ни как ни влияет
        switch (g_Uset)                                                         // режим вывода (пользовательский - User)
        {   case 0:                                                             // тестовый вывод - "4321"
                    break;
            case 1: Uadc = (0.4016 * ADCrez) + 9.5684;                          // вывод напряжения
                    SetDataDisp (1,(unsigned short)Uadc);   
                    ADCSR |= Bit(ADSC);
                    break;  
            case 2: SetDataDisp (2,mg_fuel);                                    // общий расход
                    break;
            case 3: SetDataDisp (3,mg_rash);                                    // часовой расход                
                    break;
            case 4: SetDataDisp (4,g_Hset);
                    break;
                    
            default:
                    break;              
        }
      timer_count=0;  
    }   
    timer_count++;
    //----------------
    timer2comp=0;
    }

}
}
